---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.UnableToCreateAttachedGroup
source: html/c99eff10-e18e-0916-0832-fedcbbce5f07.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.UnableToCreateAttachedGroup Property

Unable to create attached detail group in view '[View Name]' for the selected elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToCreateAttachedGroup { get; }
```